---
kind: method
id: M:Autodesk.Revit.DB.SunAndShadowSettings.IsBeforeEndDateAndTime(System.DateTime)
source: html/e67696b5-0ad9-42f6-c58c-ae65f71c8754.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.IsBeforeEndDateAndTime Method

Checks whether the start date and time is valid.

## Syntax (C#)
```csharp
public bool IsBeforeEndDateAndTime(
	DateTime time
)
```

## Parameters
- **time** (`System.DateTime`) - Date and time value

## Returns
True if the date and time is valid, false otherwise.